@echo off

echo #######################################
echo ######    新城中学防攻击脚本     ######
echo ######     by yuandeyou.org      ######
echo ######  请以管理员身份运行本脚本 ######
echo #######################################
echo %date:~0,10%
echo 注意：执行本脚本，只保证有线连接新城中学网络的计算机，网络稳定不受干扰。
echo       通过无线路由器WIFI上网的，本脚本无效，要想网络稳定，
echo       只能希望没有人插错路由器；或在智能手机上安装专门的arp防护软件。

echo [执行脚本]请按"1",[撤消脚本]请按“2”
set /p rnc=请选择并按回车确认：
if %rnc%==1 goto AA
if %rnc%==2 goto BB

:AA
netsh -c "i i" add neighbors 11 "192.168.1.1" "74-25-8a-37-98-f2"
arp -s 192.168.1.1 74-25-8a-37-98-f2
echo 设置防护中...
echo       设置防护中......
echo             设置防护成功，请按回车键退出！
echo #######################################
pause & exit

:BB
arp -d
echo 撤消中...
echo       撤消中......
echo             撤消成功，请按回车键退出！
echo #######################################
pause & exit

